Revit 2024 API
FamilySizeTableManager.GetAllSizeTableNames Method
 Get the FamilySizeTable names in a family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public IList<string> GetAllSizeTableNames()
Visual Basic
Public Function GetAllSizeTableNames As IList(Of String)
Visual C++
public:
IList<String^>^ GetAllSizeTableNames()
Return Value
 Array of size table names.
See Also
FamilySizeTableManager Class
Autodesk.Revit.DB Namespace